Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: ColorMatrix user defined functions Reference
fr: ColorMatrix - Référence

source: CustomLineCap user defined functions Reference
fr: CustomLineCap - Référence

source: Creates a CustomLineCap object
fr: Crée un embout personnalisé pour une ligne

source: Sets the distance between the base cap to the start of the line
fr: Définit les styles des embouts pour démarrer et terminer une ligne.

source: Effect user defined functions Reference
fr: Effect - Référence

source: Creates a BrightnessContrast class effect object
fr: Crée un objet Effect qui modifie luminosité/contraste

source: Font user defined functions Reference
fr: Font - Référence

source: FontFamily user defined functions Reference
fr: FontFamily - Référence

source: Gets the cell ascent, in design units, of a font family for the specified style or style combination
fr: Obtient la ligne ascendante, en unités de design, d'une famille de polices pour un style ou une combinaison de styles spécifié.

source: Gets the cell descent, in design units, of a font family for the specified style or style combination
fr: Obtient la ligne descendante, en unités de design, d'une famille de polices pour un style ou une combinaison de style spécifié

source: Graphics user defined functions Reference
fr: Graphics - Référence

source: Gets the compositing mode currently set for a Graphics object
fr: Obtient le mode de composition courant installé pour l'objet Graphics

source: Sets the compositing mode of a Graphics object
fr: Définit le mode de composition d'un objet Graphics

source: GraphicsCoders user defined functions Reference
fr: GraphicsCoders - Référence

source: GraphicsPath user defined functions Reference
fr: GraphicsPath - Référence

source: Creates a GraphicsPath object and initializes the fill mode
fr: Crée un objet GraphicsPath et initialise le mode de remplissage

source: Applies a warp transformation to a path.The function also flattens (converts to a sequence of straight lines) the path
fr: Applique une distorsion (définit par un rectangle et son parallélogramme transformé) à un tracé (GraphicsPath).La fonction aplatit aussi le tracé.

source: HashBrush user defined functions Reference
fr: HashBrush - Référence

source: Image user defined functions Reference
fr: Image - Référence

source: ImageAttributes user defined functions Reference
fr: ImageAttributes - Référence

source: LineBrush user defined functions Reference
fr: LineBrush - Référence

source: Sets the blend factors and the blend positions of a linear gradient brush to create a custom blend
fr: Définit les taux de mélange des couleurs et des positions associées pour créer un dégradé personnalisé

source: Matrix user defined functions Reference
fr: Matrix - Référence

source: PathGradientBrush user defined functions Reference
fr: PathGradientBrush - Référence

source: Creates a PathGradientBrush object based on an array of points and initializes the wrap mode of the brush
fr: Crée un objet PathGradientBrush, pinceau à couleurs dégradées de tracé qui remplit l'intérieur d'un objet GraphicsPath, à partir d'un tableau de points et d'un mode d'habillage

source: Gets the wrap mode currently set for a path gradient brush
fr: Obtient le mode d'habillage actif pour un pinceau à couleurs dégradées de tracé

source: Sets the blend factors and the blend positions of a path gradient brush
fr: Définit les taux de mélande des couleurs et des positions associées d'un pinceau à couleurs dégradées de tracé

source: PathIterator user defined functions Reference
fr: PathIterator - Référence

source: Creates a new GraphicsPathIterator object and associates it with a GraphicsPath object
fr: Crée un nouvel objet GraphicsPathIterator associé à un objet GraphicsPath spécifié

source: Pen user defined functions Reference
fr: Pen - Référence

source: Sets the miter limit of a Pen object
fr: Définit la limite de la mitre relative à un objet crayon

source: Sets the start cap for a Pen object
fr: Définit l'embout de début de ligne pour un crayon

source: Region user defined functions Reference
fr: Region - Référence

source: Creates a region that is infinite
fr: Crée une région (Region) avec un intérieur infini

source: SolidBrush user defined functions Reference
fr: SolidBrush - Référence

source: StringFormat user defined functions Reference
fr: StringFormat - Référence

source: Create a String Format object
fr: Crée un objet StringFormat

source: Text user defined functions Reference
fr: Text - Référence

source: TextureBrush user defined functions Reference
fr: TextureBrush - Référence

source: Graphic and Sound functions Reference
fr: Graphic and Sound - Référence Fonctions

source: Generates a checksum for a region of pixels.
fr: Génère une somme de contrôle dans une région de pixels.

source: Returns a pixel color according to x,y pixel coordinates.
fr: Retourne la couleur d'un pixel de coordonnées données.

source: Searches a rectangle of pixels for the pixel color provided.
fr: Recherche dans un rectangle de pixels, un pixel de couleur donnée.

source: Play a sound file.
fr: Joue un fichier audio.

source: Sets the system wave volume by percent.
fr: Règle le volume du son du système en pourcentage.

source: GuiAVI user defined functions Reference
fr: GuiAVI - Référence

source: When using them you need to add a #include <GuiAVI.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiAVI.au3>.

source: GuiButton user defined functions Reference
fr: GuiButton - Référence

source: When using them you need to add a #include <GuiButton.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiButton.au3>.

source: GuiComboBox user defined functions Reference
fr: GuiComboBox - Référence

source: When using them you need to add a #include <GuiComboBox.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiComboBox.au3>.

source: GuiComboBoxEx user defined functions Reference
fr: GuiComboBoxEx - Référence

source: When using them you need to add a #include <GuiComboBoxEx.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiComboBoxEx.au3>.

source: GuiDateTimePicker user defined functions Reference
fr: GuiDateTimePicker - Référence

source: When using them you need to add a #include <GuiDateTimePicker.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiDateTimePicker.au3>.

source: GuiEdit user defined functions Reference
fr: GuiEdit - Référence

source: When using them you need to add a #include <GuiEdit.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiEdit.au3>.

source: GuiHeader user defined functions Reference
fr: GuiHeader - Référence

source: When using them you need to add a #include <GuiHeader.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiHeader.au3>.

source: GuiImageList user defined functions Reference
fr: GuiImageList - Référence

source: When using them you need to add a #include <GuiImageList.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiImageList.au3>.

source: GuiIPAddress user defined functions Reference
fr: GuiIPAddress - Référence

source: When using them you need to add a #include <GuiIPAddress.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiIPAddress.au3>.

source: GuiListBox user defined functions Reference
fr: GuiListBox - Référence

source: When using them you need to add a #include <GuiListBox.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiListBox.au3>.

source: GuiListView user defined functions Reference
fr: GuiListView - Référence

source: When using them you need to add a #include <GuiListView.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiListView.au3>.

source: GuiMenu user defined functions Reference
fr: GuiMenu - Référence

source: When using them you need to add a #include <GuiMenu.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiMenu.au3>.

source: GuiMonthCal user defined functions Reference
fr: GuiMonthCal - Référence

source: When using them you need to add a #include <GuiMonthCal.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiMonthCal.au3>.

source: GuiReBar user defined functions Reference
fr: GuiReBar - Référence

source: When using them you need to add a #include <GuiReBar.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiReBar.au3>.

source: GuiRichEdit user defined functions Reference
fr: GuiRichEdit - Référence

source: When using them you need to add a #include <GuiRichEdit.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiRichEdit.au3>.

source: GuiScrollBars user defined functions Reference
fr: GuiScrollBars - Référence

source: When using them you need to add a #include <GuiScrollBars.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiScrollBars.au3>.

source: GuiSlider user defined functions Reference
fr: GuiSlider - Référence

source: When using them you need to add a #include <GuiSlider.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiSlider.au3>.

source: GuiStatusBar user defined functions Reference
fr: GuiStatusBar - Référence

source: When using them you need to add a #include <GuiStatusBar.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiStatusBar.au3>.

source: GuiTab user defined functions Reference
fr: GuiTab - Référence

source: When using them you need to add a #include <GuiTab.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiTab.au3>.

source: GuiToolbar user defined functions Reference
fr: GuiToolbar - Référence

source: When using them you need to add a #include <GuiToolbar.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiToolbar.au3>.

source: GuiToolTip user defined functions Reference
fr: GuiToolTip - Référence

source: When using them you need to add a #include <GuiToolTip.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiToolTip.au3>.

source: GuiTreeView user defined functions Reference
fr: GuiTreeView - Référence

source: When using them you need to add a #include <GuiTreeView.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <GuiTreeView.au3>.

source: GUI functions Reference
fr: GUI - Référence Fonctions

source: See Gui Constants include files if you need to use the related controls Constants .
fr: Consultez les fichiers 'include' Gui Constants si vous avez besoin d'utiliser des constantes relatives à des contrôles.

source: Create a GUI window.
fr: Crée une fenêtre GUI.

source: Returns the handle for a control and some special (item) handles (Menu, ContextMenu, TreeViewItem).
fr: Retourne le handle d'un contrôle et certains handles spéciaux (Menu, ContextMenu, TreeViewItem).

source: Gets the current state of a control.
fr: Obtient l'état actuel d'un contrôle.

source: Read state or data of a control.
fr: Lit l'état ou les données d'un contrôle.

source: Send a message to a control and retrieve information in lParam.
fr: Envoie un message à un contrôle et retourne des informations dans lParam.

source: Send a message to a control.
fr: Envoie un message à un contrôle.

source: Sends a message to a Dummy control.
fr: Envoie un message à un contrôle factice.

source: Deletes a GUI window and all controls that it contains.
fr: Supprime une fenêtre GUI et tous les contrôles qu'elle contient.

source: Gets the mouse cursor position relative to GUI window.
fr: Obtient la position du curseur de la souris par rapport à la fenêtre GUI.

source: Polls the GUI to see if any events have occurred.
fr: Sonde la GUI pour voir si des événements ont été déclenchés.

source: Retrieves the styles of a GUI window.
fr: Récupère les styles d'une fenêtre GUI.

source: Register a user defined function for a known Windows Message ID (WM_MSG).
fr: Enregistre une fonction utilisateur pour un ID de message Windows connu (WM_MSG).

source: Defines that any subsequent controls that are created will be "grouped" together.
fr: Détermine que les contrôles ultérieurs qui seront créés seront "groupés" ensemble.

source: Switches the current window used for GUI functions.
fr: Commute la fenêtre courante utilisée pour les fonctions de la GUI.

source: The title of the dialog box.
fr: Le titre de la boîte de dialogue.

source: The width of the window.
fr: La largeur de la fenêtre.

source: The height of the window.
fr: La hauteur de la fenêtre.

source: The left side of the dialog box.
fr: La position du côté gauche de la boîte de dialogue.

source: By default (-1), the window is centered.
fr: Par défaut (-1), la fenêtre est centrée.

source: If defined, top must also be defined.
fr: Si défini, la position haute doit également être définie.

source: The top of the dialog box.
fr: La position haute de la boîte de dialogue.

source: Default (-1) is centered
fr: Par défaut (-1), la fenêtre est centrée.

source: defines the style of the window.
fr: définit le style de la fenêtre.

source: See GUI Control Styles Appendix.
fr: Consultez Styles des contrôles GUI.

source: Use -1 for the default style which includes a combination of $WS_MINIMIZEBOX, $WS_CAPTION, $WS_POPUP, $WS_SYSMENU styles.
fr: Utilisez -1 pour le style par défaut, qui inclut une combinaison des styles $WS_MINIMIZEBOX, $WS_CAPTION, $WS_POPUP et $WS_SYSMENU.

source: Some styles are always included:
fr: Certains styles sont toujours inclus:

source: $WS_CLIPSIBLINGS, and $WS_SYSMENU if $WS_MAXIMIZEBOX or $WS_SIZEBOX is specified.
fr: $WS_CLIPSIBLINGS et $WS_SYSMENU si $WS_MAXIMIZEBOX ou $WS_SIZEBOX sont spécifiés.

source: defines the extended style of the window.
fr: définit le style étendu de la fenêtre.

source: See the Extended Style Table below.
fr: Consultez la Table des Styles Étendus ci-dessous.

source: Use -1 for the default, which is no extended styles.
fr: Utilisez -1 pour valeur par défaut, ce qui correspond à aucun style étendu.

source: Forced styles:
fr: Styles forcés:

source: The handle of another previously created window - this new window then becomes a child of that window.
fr: Le handle d'une fenêtre précédemment créé - La nouvelle fenêtre devient alors un enfant de cette fenêtre.

source: a windows handle.
fr: Retourne le handle de la fenêtre.

source: 0 if the window cannot be created and sets the @error flag to 1.
fr: Retourne 0 si la fenêtre ne peut pas être créé et @error = 1.

source: By default the dialog box is non sizable and non maximizable.
fr: Par défaut la taille de la boîte de dialogue ne peut pas être modifiée ni maximisée.

source: So WS_SIZEBOX or WS_MAXIMIZEBOX can be used in the style parameter.
fr: WS_SIZEBOX ou WS_MAXIMIZEBOX peuvent être utilisés dans le paramètre de style.

source: As defining only one style just set this style don't forget to combine it with default ones, i.e. just defining WS_SIZEBOX will not set $WS_MINIMIZEBOX, $WS_CAPTION, $WS_POPUP, $WS_SYSMENU.
fr: La définition d'un seul style n'applique que le style définit, donc n'oubliez pas de le combiner avec les styles par défaut.Si par exemple vous ne définissez que WS_SIZEBOX, alors WS_MINIMIZEBOX, WS_CAPTION, WS_POPUP et WS_SYSMENU ne seront pas utilisés.

source: So the best method to define a resizeable window is to use $WS_OVERLAPPEDWINDOW.
fr: Donc, la meilleure méthode pour définir une fenêtre redimensionnable est d'utiliser WS_OVERLAPPEDWINDOW.

source: When using $WS_EX_MDICHILD the position is relative to client area of the parent window.
fr: Lorsque vous utilisez $WS_EX_MDICHILD, la position est relative à la zone client de la fenêtre parent.

source: With $WS_EX_LAYERED it is possible to have a transparent picture on a background picture defined in the parent window.
fr: Avec $WS_EX_LAYERED il est possible d'avoir une image transparente sur une image de fond défini dans la fenêtre parent.

source: Adding $WS_CLIPCHILDREN style can avoid some flickering when resizing GUI containing Edit control for example.
fr: L'ajout du style $WS_CLIPCHILDREN peut éviter un certain scintillement lors du redimensionnement d'une GUI avec par exemple un contrôle Edit.

source: You can enable window dragging for GUI without $WS_CAPTION by using $WS_EX_CONTROLPARENT in the exStyle parameter.
fr: Vous pouvez activer le déplacement d'une fenêtre sans $WS_CAPTION en utilisant $WS_EX_CONTROLPARENT dans les paramètres étendus (exStyle).

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_GUI, newstyle, ...).
fr: Pour combiner les styles avec les styles par défaut, utilisez BitOR($GUI_SS_DEFAULT_GUI, newstyle, ...).

source: The size specified is the size of the client area of the window.
fr: La taille spécifiée est la taille de la zone cliente de la fenêtre.

source: The border and title bar will make the window slightly larger than specified.
fr: La bordure et la barre de titre feront que la fenêtre sera légèrement plus grande que la taille spécifiée.

source: Using menu controls will also change the windows height.
fr: L'utilisation de menu de commandes changera aussi la hauteur des fenêtres.

source: Extended Style table
fr: Table des Styles Étendus

source: Extended Style
fr: style étendu

source: result
fr: résultat

source: Allow an edit or input control within the created GUI window to receive filenames via drag and drop.
fr: Autorise un contrôle Edit ou un contrôle Input dans la fenêtre GUI créée, à recevor des noms de fichiers par glisser-déposer.

source: The control must have also the $GUI_DROPACCEPTED state set by GUICtrlSetState().
fr: Le contrôle doit aussi avoir l'état $GUI_DROPACCEPTED attribué par GUICtrlSetState.

source: for other controls the drag&drop info can be retrieved with @GUI_DragId, @GUI_DragFile, @GUI_DropId.
fr: Pour d'autres contrôles, l'info glisser-déposer peut être récupérée par @GUI_DRAGID, @GUI_DRAGFILE ou @GUIDROPID.

source: Forces a top-level window onto the taskbar when the window is visible.
fr: Met la fenêtre au premier plan sur la barre des tâches lorsque la fenêtre est visible.

source: Specifies that a window has a border with a sunken edge.
fr: Indique que la fenêtre a une bordure avec un bord creux.

source: Includes a question mark in the title bar of the window.
fr: Inclut un point d'interrogation dans la barre de titre de la fenêtre.

source: Cannot be used with the $WS_MAXIMIZEBOX or $WS_MINIMIZEBOX.
fr: Ne peut être utilisé avec WS_MAXIMIZEBOX ou WS_MINIMIZEBOX.

source: Creates a window that has a double border; the window can, optionally, be created with a title bar by specifying the WS_CAPTION style in the style parameter.
fr: Crée une fenêtre qui a une double bordure, la fenêtre peut, éventuellement, être créée avec une barre de titre en spécifiant le style WS_CAPTION dans le paramètre de style.

source: Create a child window included in its parent window (simulation not real MDI).
fr: Crée une fenêtre enfant incluse dans sa fenêtre parente (simulation, pas rééllement un MDI).

source: Combines the $WS_EX_CLIENTEDGE and $WS_EX_WINDOWEDGE styles.
fr: Combine les styles WS_EX_CLIENTEDGE et WS_EX_WINDOWEDGE.

source: Creates a window with a three-dimensional border style intended to be used for items that do not accept user input.
fr: Crée une fenêtre avec un style de bordure en trois dimensions destiné à être utilisé pour des éléments qui n'acceptent pas les entrées utilisateur.

source: Specifies that a window created with this style should be placed above all non-topmost windows and should stay above them, even when the window is deactivated.
fr: Indique que la fenêtre créée avec ce style doit être placée par-dessus toutes les fenêtres qui ne sont pas d'avant-plan et devrait rester par-dessus, même lorsque la fenêtre est désactivée.

source: The window appears transparent because the bits of underlying sibling windows have already been painted.
fr: La fenêtre apparaît transparente car les bits des fenêtres enfant sous-jacentes de même parent ont déjà été peints.

source: Creates a tool window; that is, a window intended to be used as a floating toolbar.
fr: Crée une fenêtre outil, qui est une fenêtre destinée à être utilisée comme une barre d'outils flottante.

source: A tool window has a title bar that is shorter than a normal title bar, and the window title is drawn using a smaller font.
fr: Une fenêtre outil a une barre de titre qui est plus petite que la barre de titre normale, et dont la police du titre est plus petite.

source: A tool window does not appear in the taskbar or in the dialog box that appears when the user presses ALT+TAB.
fr: Une fenêtre outil n'apparaît pas dans la barre des tâches ou dans la boîte de dialogue qui s'affiche lorsque l'utilisateur appuie sur ALT+TAB.

source: If a tool window has a system menu, its icon is not displayed on the title bar.
fr: Si une fenêtre outil dispose d'un menu système, son icône n'est pas affichée dans la barre de titre.

source: However, you can display the system menu by typing ALT+SPACE.
fr: Cependant, vous pouvez afficher le menu système en tapant ALT+ESPACE.

source: Specifies that a window has a border with a raised edge.
fr: Indique que la fenêtre a une bordure en relief.

source: Creates a layered window.
fr: Crée une fenêtre de superposition (alphablend).

source: Note that this cannot be used for child windows.
fr: Notez que cela ne peut pas être utilisé pour les fenêtres enfants.

source: To use the values specified above you must #include <WindowsConstants.au3> in your script.
fr: Pour utiliser les valeurs spécifiées ci-dessus, vous devez ajouter la ligne :#include <WindowsConstants.au3> dans votre script.

source: The handle returned from this function is a real windows handle, which means it can be used in the same way as the result of WinGetHandle().
fr: Le handle renvoyé par cette fonction est un véritable handle de fenêtres, ce qui signifie qu'il peut être utilisé de la même manière que le résultat de WinGetHandle().

source: Create a GUI with various controls.
fr: Crée une interface graphique avec différents contrôles.

source: Display the GUI.
fr: Affiche l'interface graphique.

source: Delete the previous GUI and all controls.
fr: Supprimer l'interface graphique précédente et toutes les commandes.

source: Create a picture control with a transparent image.
fr: Crée un contrôle d'image avec une image transparente.

source: Display the child GUI.
fr: Affiche l'interface graphique enfant.

source: Delete the previous GUIs and all controls.
fr: Supprime les interfaces graphiques précédentes et tous les contrôles.

source: GUI Control creation functions Reference
fr: GUI Control creation - Référence Fonctions

source: Creates an AVI video control for the GUI.
fr: Crée un contrôle vidéo AVI dans une GUI.

source: Creates a Button control for the GUI.
fr: Crée un contrôle Button (bouton) dans la GUI.

source: Creates a Checkbox control for the GUI.
fr: Crée un contrôle Chekbox (cases à cocher) dans une GUI.

source: Creates a ComboBox control for the GUI.
fr: Crée un Contrôle ComboBox dans une GUI.

source: Creates a context menu for a control or entire GUI window.
fr: Crée un menu contextuel pour un contrôle ou pour toute la fenêtre GUI.

source: Creates a date control for the GUI.
fr: Crée un contrôle date dans une GUI.

source: Creates a Dummy control for the GUI.
fr: Crée un contrôle fictif dans la GUI.

source: Creates an Edit control for the GUI.
fr: Crée un contrôle Edit pour l'interface graphique.

source: Creates a Graphic control for the GUI.
fr: Crée un contrôle graphique dans une GUI.

source: Creates a Group control for the GUI.
fr: Crée un contrôle de groupe dans une GUI.

source: Creates an Icon control for the GUI.
fr: Crée un contrôle Icône dans une GUI.

source: Creates an Input control for the GUI.
fr: Crée un contrôle Input dans une GUI.

source: Creates a static Label control for the GUI.
fr: Crée un contrôle Label dans une GUI.
